Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64MU502.h
#define _RPINR38_DTCMP1R1_POSITION               0x00000009
#define _RPINR38_DTCMP1R1_MASK                   0x00000200
#define _RPINR38_DTCMP1R1_LENGTH                 0x00000001

#define _RPINR38_DTCMP1R2_POSITION               0x0000000A
#define _RPINR38_DTCMP1R2_MASK                   0x00000400
#define _RPINR38_DTCMP1R2_LENGTH                 0x00000001

#define _RPINR38_DTCMP1R3_POSITION               0x0000000B
#define _RPINR38_DTCMP1R3_MASK                   0x00000800
#define _RPINR38_DTCMP1R3_LENGTH                 0x00000001

#define _RPINR38_DTCMP1R4_POSITION               0x0000000C
#define _RPINR38_DTCMP1R4_MASK                   0x00001000
#define _RPINR38_DTCMP1R4_LENGTH                 0x00000001

#define _RPINR38_DTCMP1R5_POSITION               0x0000000D
#define _RPINR38_DTCMP1R5_MASK                   0x00002000
#define _RPINR38_DTCMP1R5_LENGTH                 0x00000001

#define _RPINR38_DTCMP1R6_POSITION               0x0000000E
#define _RPINR38_DTCMP1R6_MASK                   0x00004000
#define _RPINR38_DTCMP1R6_LENGTH                 0x00000001

#define _RPINR39_DTCMP2R_POSITION                0x00000000
#define _RPINR39_DTCMP2R_MASK                    0x0000007F
#define _RPINR39_DTCMP2R_LENGTH                  0x00000007

#define _RPINR39_DTCMP3R_POSITION                0x00000008
#define _RPINR39_DTCMP3R_MASK                    0x00007F00
#define _RPINR39_DTCMP3R_LENGTH                  0x00000007

#define _RPINR39_DTCMP2R0_POSITION               0x00000000
#define _RPINR39_DTCMP2R0_MASK                   0x00000001
#define _RPINR39_DTCMP2R0_LENGTH                 0x00000001

#define _RPINR39_DTCMP2R1_POSITION               0x00000001
#define _RPINR39_DTCMP2R1_MASK                   0x00000002
#define _RPINR39_DTCMP2R1_LENGTH                 0x00000001

#define _RPINR39_DTCMP2R2_POSITION               0x00000002
#define _RPINR39_DTCMP2R2_MASK                   0x00000004
#define _RPINR39_DTCMP2R2_LENGTH                 0x00000001

#define _RPINR39_DTCMP2R3_POSITION               0x00000003
#define _RPINR39_DTCMP2R3_MASK                   0x00000008
#define _RPINR39_DTCMP2R3_LENGTH                 0x00000001

#define _RPINR39_DTCMP2R4_POSITION               0x00000004
#define _RPINR39_DTCMP2R4_MASK                   0x00000010
#define _RPINR39_DTCMP2R4_LENGTH                 0x00000001

#define _RPINR39_DTCMP2R5_POSITION               0x00000005
#define _RPINR39_DTCMP2R5_MASK                   0x00000020
#define _RPINR39_DTCMP2R5_LENGTH                 0x00000001

#define _RPINR39_DTCMP2R6_POSITION               0x00000006
#define _RPINR39_DTCMP2R6_MASK                   0x00000040
#define _RPINR39_DTCMP2R6_LENGTH                 0x00000001

#define _RPINR39_DTCMP3R0_POSITION               0x00000008
#define _RPINR39_DTCMP3R0_MASK                   0x00000100
#define _RPINR39_DTCMP3R0_LENGTH                 0x00000001

#define _RPINR39_DTCMP3R1_POSITION               0x00000009
#define _RPINR39_DTCMP3R1_MASK                   0x00000200
#define _RPINR39_DTCMP3R1_LENGTH                 0x00000001

#define _RPINR39_DTCMP3R2_POSITION               0x0000000A
#define _RPINR39_DTCMP3R2_MASK                   0x00000400
#define _RPINR39_DTCMP3R2_LENGTH                 0x00000001

#define _RPINR39_DTCMP3R3_POSITION               0x0000000B
#define _RPINR39_DTCMP3R3_MASK                   0x00000800
#define _RPINR39_DTCMP3R3_LENGTH                 0x00000001

#define _RPINR39_DTCMP3R4_POSITION               0x0000000C
#define _RPINR39_DTCMP3R4_MASK                   0x00001000
#define _RPINR39_DTCMP3R4_LENGTH                 0x00000001

#define _RPINR39_DTCMP3R5_POSITION               0x0000000D
#define _RPINR39_DTCMP3R5_MASK                   0x00002000
#define _RPINR39_DTCMP3R5_LENGTH                 0x00000001

#define _RPINR39_DTCMP3R6_POSITION               0x0000000E
#define _RPINR39_DTCMP3R6_MASK                   0x00004000
#define _RPINR39_DTCMP3R6_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R_POSITION                0x00000000
#define _RPINR40_DTCMP4R_MASK                    0x0000007F
#define _RPINR40_DTCMP4R_LENGTH                  0x00000007

#define _RPINR40_DTCMP5R_POSITION                0x00000008
#define _RPINR40_DTCMP5R_MASK                    0x00007F00
#define _RPINR40_DTCMP5R_LENGTH                  0x00000007

#define _RPINR40_DTCMP4R0_POSITION               0x00000000
#define _RPINR40_DTCMP4R0_MASK                   0x00000001
#define _RPINR40_DTCMP4R0_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R1_POSITION               0x00000001
#define _RPINR40_DTCMP4R1_MASK                   0x00000002
#define _RPINR40_DTCMP4R1_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R2_POSITION               0x00000002
#define _RPINR40_DTCMP4R2_MASK                   0x00000004
#define _RPINR40_DTCMP4R2_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R3_POSITION               0x00000003
#define _RPINR40_DTCMP4R3_MASK                   0x00000008
#define _RPINR40_DTCMP4R3_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R4_POSITION               0x00000004
#define _RPINR40_DTCMP4R4_MASK                   0x00000010
#define _RPINR40_DTCMP4R4_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R5_POSITION               0x00000005
#define _RPINR40_DTCMP4R5_MASK                   0x00000020
#define _RPINR40_DTCMP4R5_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R6_POSITION               0x00000006
#define _RPINR40_DTCMP4R6_MASK                   0x00000040
#define _RPINR40_DTCMP4R6_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R0_POSITION               0x00000008
#define _RPINR40_DTCMP5R0_MASK                   0x00000100
#define _RPINR40_DTCMP5R0_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R1_POSITION               0x00000009
#define _RPINR40_DTCMP5R1_MASK                   0x00000200
#define _RPINR40_DTCMP5R1_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R2_POSITION               0x0000000A
#define _RPINR40_DTCMP5R2_MASK                   0x00000400
#define _RPINR40_DTCMP5R2_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R3_POSITION               0x0000000B
#define _RPINR40_DTCMP5R3_MASK                   0x00000800
#define _RPINR40_DTCMP5R3_LENGTH                 0x00000001

