Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64MU502.h
#define _DMA3REQ_FORCE_POSITION                  0x0000000F
#define _DMA3REQ_FORCE_MASK                      0x00008000
#define _DMA3REQ_FORCE_LENGTH                    0x00000001

#define _DMA3REQ_IRQSEL0_POSITION                0x00000000
#define _DMA3REQ_IRQSEL0_MASK                    0x00000001
#define _DMA3REQ_IRQSEL0_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL1_POSITION                0x00000001
#define _DMA3REQ_IRQSEL1_MASK                    0x00000002
#define _DMA3REQ_IRQSEL1_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL2_POSITION                0x00000002
#define _DMA3REQ_IRQSEL2_MASK                    0x00000004
#define _DMA3REQ_IRQSEL2_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL3_POSITION                0x00000003
#define _DMA3REQ_IRQSEL3_MASK                    0x00000008
#define _DMA3REQ_IRQSEL3_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL4_POSITION                0x00000004
#define _DMA3REQ_IRQSEL4_MASK                    0x00000010
#define _DMA3REQ_IRQSEL4_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL5_POSITION                0x00000005
#define _DMA3REQ_IRQSEL5_MASK                    0x00000020
#define _DMA3REQ_IRQSEL5_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL6_POSITION                0x00000006
#define _DMA3REQ_IRQSEL6_MASK                    0x00000040
#define _DMA3REQ_IRQSEL6_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL7_POSITION                0x00000007
#define _DMA3REQ_IRQSEL7_MASK                    0x00000080
#define _DMA3REQ_IRQSEL7_LENGTH                  0x00000001

#define _DMA3STAH_STA_POSITION                   0x00000000
#define _DMA3STAH_STA_MASK                       0x000000FF
#define _DMA3STAH_STA_LENGTH                     0x00000008

#define _DMA3STBH_STB_POSITION                   0x00000000
#define _DMA3STBH_STB_MASK                       0x000000FF
#define _DMA3STBH_STB_LENGTH                     0x00000008

#define _DMA3CNT_CNT_POSITION                    0x00000000
#define _DMA3CNT_CNT_MASK                        0x00003FFF
#define _DMA3CNT_CNT_LENGTH                      0x0000000E

#define _DMAPWC_PWCOL0_POSITION                  0x00000000
#define _DMAPWC_PWCOL0_MASK                      0x00000001
#define _DMAPWC_PWCOL0_LENGTH                    0x00000001

#define _DMAPWC_PWCOL1_POSITION                  0x00000001
#define _DMAPWC_PWCOL1_MASK                      0x00000002
#define _DMAPWC_PWCOL1_LENGTH                    0x00000001

#define _DMAPWC_PWCOL2_POSITION                  0x00000002
#define _DMAPWC_PWCOL2_MASK                      0x00000004
#define _DMAPWC_PWCOL2_LENGTH                    0x00000001

#define _DMAPWC_PWCOL3_POSITION                  0x00000003
#define _DMAPWC_PWCOL3_MASK                      0x00000008
#define _DMAPWC_PWCOL3_LENGTH                    0x00000001

#define _DMARQC_RQCOL0_POSITION                  0x00000000
#define _DMARQC_RQCOL0_MASK                      0x00000001
#define _DMARQC_RQCOL0_LENGTH                    0x00000001

#define _DMARQC_RQCOL1_POSITION                  0x00000001
#define _DMARQC_RQCOL1_MASK                      0x00000002
#define _DMARQC_RQCOL1_LENGTH                    0x00000001

#define _DMARQC_RQCOL2_POSITION                  0x00000002
#define _DMARQC_RQCOL2_MASK                      0x00000004
#define _DMARQC_RQCOL2_LENGTH                    0x00000001

#define _DMARQC_RQCOL3_POSITION                  0x00000003
#define _DMARQC_RQCOL3_MASK                      0x00000008
#define _DMARQC_RQCOL3_LENGTH                    0x00000001

#define _DMAPPS_PPST0_POSITION                   0x00000000
#define _DMAPPS_PPST0_MASK                       0x00000001
#define _DMAPPS_PPST0_LENGTH                     0x00000001

#define _DMAPPS_PPST1_POSITION                   0x00000001
#define _DMAPPS_PPST1_MASK                       0x00000002
#define _DMAPPS_PPST1_LENGTH                     0x00000001

#define _DMAPPS_PPST2_POSITION                   0x00000002
#define _DMAPPS_PPST2_MASK                       0x00000004
#define _DMAPPS_PPST2_LENGTH                     0x00000001

#define _DMAPPS_PPST3_POSITION                   0x00000003
#define _DMAPPS_PPST3_MASK                       0x00000008
#define _DMAPPS_PPST3_LENGTH                     0x00000001

#define _DMALCA_LSTCH_POSITION                   0x00000000
#define _DMALCA_LSTCH_MASK                       0x0000000F
#define _DMALCA_LSTCH_LENGTH                     0x00000004

#define _DMALCA_LSTCH0_POSITION                  0x00000000
#define _DMALCA_LSTCH0_MASK                      0x00000001
#define _DMALCA_LSTCH0_LENGTH                    0x00000001

#define _DMALCA_LSTCH1_POSITION                  0x00000001
#define _DMALCA_LSTCH1_MASK                      0x00000002
#define _DMALCA_LSTCH1_LENGTH                    0x00000001

#define _DMALCA_LSTCH2_POSITION                  0x00000002
#define _DMALCA_LSTCH2_MASK                      0x00000004
#define _DMALCA_LSTCH2_LENGTH                    0x00000001

#define _DMALCA_LSTCH3_POSITION                  0x00000003
#define _DMALCA_LSTCH3_MASK                      0x00000008
#define _DMALCA_LSTCH3_LENGTH                    0x00000001

#define _DSADRH_DSADR_POSITION                   0x00000000
#define _DSADRH_DSADR_MASK                       0x000000FF
#define _DSADRH_DSADR_LENGTH                     0x00000008

#define _PTCON_SEVTPS_POSITION                   0x00000000
#define _PTCON_SEVTPS_MASK                       0x0000000F
#define _PTCON_SEVTPS_LENGTH                     0x00000004

#define _PTCON_SYNCSRC_POSITION                  0x00000004
#define _PTCON_SYNCSRC_MASK                      0x00000070
#define _PTCON_SYNCSRC_LENGTH                    0x00000003

#define _PTCON_SYNCEN_POSITION                   0x00000007
#define _PTCON_SYNCEN_MASK                       0x00000080
#define _PTCON_SYNCEN_LENGTH                     0x00000001

#define _PTCON_SYNCOEN_POSITION                  0x00000008
#define _PTCON_SYNCOEN_MASK                      0x00000100
#define _PTCON_SYNCOEN_LENGTH                    0x00000001

#define _PTCON_SYNCPOL_POSITION                  0x00000009
#define _PTCON_SYNCPOL_MASK                      0x00000200
#define _PTCON_SYNCPOL_LENGTH                    0x00000001

#define _PTCON_EIPU_POSITION                     0x0000000A
#define _PTCON_EIPU_MASK                         0x00000400
#define _PTCON_EIPU_LENGTH                       0x00000001

#define _PTCON_SEIEN_POSITION                    0x0000000B
#define _PTCON_SEIEN_MASK                        0x00000800
#define _PTCON_SEIEN_LENGTH                      0x00000001

